<template>
    <section class="tool-description wrapper">
        <h1>Филлер: Прощайте, рутина и клики!</h1>
        <p class="intro">
            Надоело вручную заполнять однотипные формы на сайтах? Данный инструмент автоматизирует этот
            процесс,
            используя мощь Selenium. Просто укажите URL, XPATH-ы элементов и данные — остальное сделает программа.
            Идеально для тестирования, массового ввода данных или рутинных операций.
        </p>
        <h2>Почему это работает лучше, чем вручную?</h2>
        <ul class="features-list">
            <li><b>Экономия времени:</b> Заполняйте сотни форм за минуты, а не часы.</li>
            <li><b>Точность:</b> Автоматическое заполнение гарантирует, что каждое действие выполняется одинаково,
                исключая пропуски или ошибки, которые могут возникнуть при ручном вводе.</li>
            <li><b>Масштабируемость операций:</b> С легкостью обрабатывайте неограниченное количество форм
                и наборов данных, не увеличивая трудозатраты. От одного до тысяч заполнений — без усилий.
            </li>
            <li><b>Адаптивность к структуре сайта:</b> Способность работать с элементами по их XPath делает инструмент
                универсальным для
                взаимодействия практически с любыми веб-формами и страницами, независимо от их внутренней структуры или
                используемых технологий.</li>
        </ul>
    </section>
    <section class="tool-instruction wrapper">
        <h2>Как пользоваться?</h2>
        <div class="tool-instruction_swiper-container" v-swiper>
            <div class="swiper-button-prev swiper-btn"></div>
            <div class="swiper">
                <div class="swiper-pagination"></div>
                <div class="swiper-wrapper">
                    <div class="swiper-slide">
                        <img src="/images/filler/autofill-2-enter-url.webp">
                        <h3>Шаг 1: Введите URL сайта</h3>
                        <p>В поле "URL сайта" укажите полный адрес страницы, которую вы хотите заполнять. Начните с
                            <code>http://</code> или <code>https://</code>.
                        </p>
                        <div class="example-box">
                            <p><b>Пример URL сайта:</b></p>
                            <pre><code>https://my-admin-panel.com/login</code></pre>
                        </div>
                    </div>
                    <div class="swiper-slide">
                        <img src="/images/filler/autofill-3-table-tag-data.webp">
                        <h3>Шаг 2: Настройте таблицу - Тэги</h3>
                        <p>Первая строка в таблице - Тэги - не функциональные ячейки для сугубо ваших заметок. Можно
                            пометить тип действия или элемента. </p>
                        <div class="example-box">
                            <p><b>Пример пользовательских тэгов:</b></p>
                            <pre><code>Кнопка добавить   Текст коментария   Имя   Отправить отзыв</code></pre>
                        </div>
                    </div>
                    <div class="swiper-slide">
                        <img src="/images/filler/autofill-4-table-Xpath-data.webp">
                        <h3>Шаг 3: Настройте таблицу - XPath</h3>
                        <p>Вторая строка в таблице - XPath - Сюда вводятся пути к элементам на
                            веб-странице. Это уникальные "адреса" для каждого поля, кнопки или другого элемента,
                            который вы хотите взаимодействовать.</p>
                        <div class="example-box">
                            <p><b>Пример XPath пути к кнопке в cms:</b></p>
                            <pre><code>//*[@id="mainViewButtons"]/div[1] </code></pre>
                        </div>
                    </div>
                    <div class="swiper-slide">
                        <img src="/images/filler/autofill-5-table-input-data.webp">
                        <h3>Шаг 4: Настройте таблицу - Данные для заполнения</h3>
                        <p>Третья и последующие строки - данные для заполнения. Сюда вводятся данные, которые будут
                            вставлены в поля,
                            соответствующие путям из второй строки. Для кнопок - поле оставлять пустым.</p>
                        <div class="example-box">
                            <p><b>Пример данных для 1-й итерации:</b></p>
                            <pre><code>	Все понравилось!	Петр</code></pre>
                        </div>
                    </div>
                    <div class="swiper-slide">
                        <img src="/images/filler/autofill-6-delay-mode.webp">
                        <h3>Шаг 5: Выберите режим задержки</h3>
                        <p><b>Умная задержка:</b> Программа попытается "понять", когда следующий элемент будет
                            прогружен и готов к взаимодействовию, также делает минимальную паузу.</p>
                        <p><b>Фиксированная задержка:</b> Укажите конкретное количество секунд, и программа будет ждать
                            ровно
                            это время после каждого действия.
                        </p>
                    </div>
                    <div class="swiper-slide">
                        <img src="/images/filler/autofill-7-start-button.webp">
                        <h3>Шаг 6: Нажмите "Начать"</h3>
                        <p>После настройки URL, таблицы и задержки нажмите "Начать". Программа запустит браузер
                            Chrome (в отдельном профиле) и начнет процесс автозаполнения.</p>
                        <p>Кнопка изменится на "Стоп", позволяя вам остановить процесс в любой момент.</p>
                    </div>
                </div>
            </div>
            <div class="swiper-button-next swiper-btn"></div>
        </div>
        <h2>Подробнее о использовании инструмента:</h2>
        <div class="instruction-step centration">
            <h3>Шаг 1: Введите URL сайта</h3>
            <p>Просто вставьте полный адрес веб-страницы по примеру в строке, на которой вы хотите выполнить
                автозаполнение. Так же принимает и работает с локальными файлами HTML по
                гиперссылкам:</p>
            <div class="example-box">
                <pre><code>C:/Users/file.html</code></pre>
            </div>
            <p>Так вы можете протестировать работу программы на тестовых самописных сайтах имитируя работу с реальным.
            </p>
            <h3>Шаг 2: Настройте таблицу - Тэги</h3>
            <p>Как и сказано выше, первая строка предназначена для ваших "Тэгов". Возможность подписать столбец не даст
                вам запутаться какой XPath принадлежит какой кнопке или полю на сайте. </p>
            <p>К заполнению не обязательно. Все что вы пишете в первой строке - не влияет на работу программы.</p>
            <h3>Шаг 3: Настройте таблицу - XPath</h3>
            <p>Как найти XPath элемента? - Это делается прямо в вашем браузере Google Chrome:</p>
            <p>Нажмите правой кнопкой мыши на элементе (поле ввода, кнопка, текстовое поле) и выберите<b>"Просмотреть
                    код"</b> (Inspect).</p>
            <p>В открывшейся панели разработчика, найдите выделенный HTML-элемент. Нажмите на этот элемент правой
                кнопкой мыши и выберите <b>"Copy"</b>, а затем<b>"Copy XPath"</b>.</p>
            <p>Скопированный XPath вставьте во вторую строку таблицы.</p>
            <div class="example-box">
                <p><b>Пример XPath для поля ввода email:</b></p>
                <pre><code>/html/body/div[1]/form/input[@name='email']</code></pre>
            </div>
            <h3>Шаг 4: Настройте таблицу - Данные для заполнения</h3>
            <p> Третья и все последующие строки используются для заполнения полей. Если действием является нажатие на
                кнопку - просто оставьте столбец пустым.</p>
            <p><b>Логика простая:</b></p>
            <p>Каждая строка, начиная с третьей - новая итерация взаимодействия с сайтом.</p>
            <p>Заполнив все
                данные из 3й строки и провзаимодействовав с каждым элементом из второй строки - программа начнет
                взаимодействие с сайтом заного с самого начала: Так же последовательно пойдет по всем путям, нажимая на
                кнопки и заполняя поля, но данные для
                заполнения будут браться уже из следующей строки. </p>
            <p>Для первой итерации - из третьей строки; <br>Для второй
                итерации - из четвертой;<br> Для третьей итерации -
                из пятой<br> и тд.</p>
            <h3>Шаг 5: Выберите режим задержки</h3>
            <p>Определите, как программа будет делать паузы между действиями:</p>
            <p><b>Умная задержка:</b> Программа будет ожидать появления следующего элемента. Это помогает избежать
                ошибок в ситуациях, когда какой либо блок не успел загрузиться или сгенерироваться, а программа уже
                пытается с ним провзаимодействовать. Работает по умолчанию значительно эффективнее фиксированной
                задержки.</p>
            <p><b>Фиксированная задержка:</b> Укажите точное время в секундах (например, 1.2), и
                программа будет ждать указанное время после каждого действия. Большие задержки позволят замедлить работу
                и обойти защиту от ботов.</p>
            <h3>Шаг 6: Нажмите "Начать"</h3>
            <p>Когда всё заполненно, нажмите кнопку <b>"Начать"</b>. Программа запустит браузер Chrome (в изолированном
                профиле)и начнет заполнять формы в соответствии с вашими настройками.</p>
            <p>Вы можете нажать <b>"Стоп"</b> в любой момент, чтобы прервать процесс.</p>
            <p><b>В процессе работы вы будете видеть:</b></p>
            <p><b>Прогресс-бар:</b> Отображает общий процент выполнения.</p>
            <p><b>Текущий статус:</b> Информирует, какая строка данных обрабатывается в данный момент
                или о возможных ошибках.</p>
            <p>По завершении процесса или в случае возникновения критической ошибки, внизу будет
                отображено
                итоговое сообщение о результате работы.</p>
            <div class="instruction-step centration">
                <h2>Важные замечания:</h2>
                <p><b>Используется отдельный профиль Chrome:</b> Программа создает временный профиль браузера в
                    вашей
                    домашней директории, чтобы не мешать вашему основному
                    профилю Chrome.</p>
                <p><b>Пустые строки данных:</b> Если в данных встречается полностью пустая строка, программа
                    остановится, предполагая, что данные закончились.</p>
                <p><b>Обработка ошибок:</b> При возникновении ошибок с конкретным элементом, программа пропустит
                    его и
                    продолжит работу с остальными, выводя сообщение об ошибке.</p>
                <p><b>Кликабельность элементов:</b> Программа пытается прокрутить страницу до элемента и дождаться
                    его
                    кликабельности, но в некоторых сложных случаях может потребоваться корректировка XPath или
                    ручная
                    отладка.</p>
            </div>
        </div>
    </section>
</template>