<template>
    <section class=" wrapper">
        <h1>Meowka</h1>
        <p class="text_indent">В мире контент-менеджеров, SEO-специалистов, копирайтеров и веб-мастеров <b>время</b> —
            самый ценный
            ресурс.
            Каждый день уходит на
            мелкие, но неотъемлемые задачи: правка и чистка HTML, расстановка внутренних ссылок для перелинковки,
            конвертация изображений в различные форматы и в том числе выкладка больших объемов однообразного контента в
            CMS. </p>
        <p style="text-align: center;"><b>Узнали свои будни?</b></p>
        <p class="text_indent"> — представьте себе единое пространство для повседневных задач. Приложение
            объединяет в себе инструменты для работы с текстом, адресами и изображениями в едином интерфейсе.</p>
        <div class="advantages-grid">
            <div class="advantage-item">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 54 73" stroke="var(--color-gray)" stroke-width="1">
                    <path class="a"
                        d="M12.35.5H53.5a0,0,0,0,1,0,0v72a0,0,0,0,1,0,0H.5a0,0,0,0,1,0,0V12.35A11.85,11.85,0,0,1,12.35.5Z" />
                    <line class="a" x1="10.5" y1="17.5" x2="44.5" y2="17.5" />
                    <line class="a" x1="10.5" y1="27.5" x2="44.5" y2="27.5" />
                    <line class="a" x1="10.5" y1="37.5" x2="44.5" y2="37.5" />
                    <line class="a" x1="10.5" y1="47.5" x2="44.5" y2="47.5" />
                </svg>
            </div>
            <div class="advantage-item">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 60 74" stroke="var(--color-gray)" stroke-width="1">
                    <line class="a" x1="6" x2="6" y2="74" />
                    <line class="a" y1="7" x2="60" y2="7" />
                    <line class="a" y1="67" x2="60" y2="67" />
                    <line class="a" x1="54" x2="54" y2="74" />
                    <path class="a"
                        d="M28.09,37h4.06A12.85,12.85,0,0,1,45,49.85v6.06a.09.09,0,0,1-.09.09H16.09a.09.09,0,0,1-.09-.09V49.09A12.09,12.09,0,0,1,28.09,37Z" />
                    <rect class="a" x="24" y="22" width="12" height="15" rx="5.74" />
                </svg>
            </div>
            <div class="advantage-item">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 58 58" stroke="var(--color-gray)" stroke-width="1">
                    <rect class="a" x="17.5" y="17.5" width="23" height="23" />
                    <path class="a"
                        d="M9,40.5H17.5a0,0,0,0,1,0,0V49A8.47,8.47,0,0,1,9,57.5H9A8.53,8.53,0,0,1,.5,49v0A8.47,8.47,0,0,1,9,40.5Z" />
                    <path class="a"
                        d="M9,.5H9A8.47,8.47,0,0,1,17.5,9V17.5a0,0,0,0,1,0,0H9A8.47,8.47,0,0,1,.5,9V9A8.53,8.53,0,0,1,9,.5Z" />
                    <path class="a"
                        d="M49,.5h0A8.53,8.53,0,0,1,57.5,9V9A8.47,8.47,0,0,1,49,17.5H40.5a0,0,0,0,1,0,0V9A8.47,8.47,0,0,1,49,.5Z" />
                    <path class="a"
                        d="M40.5,40.5h8.59a8.41,8.41,0,0,1,8.41,8.41v0a8.59,8.59,0,0,1-8.59,8.59h0a8.41,8.41,0,0,1-8.41-8.41V40.5A0,0,0,0,1,40.5,40.5Z" />
                </svg>
            </div>
            <div class="advantage-item">
                <p>Текст <br> — <br>Почистите от ненужных HTML тегов, создав одним кликом перелинковку под ваш сайт!</p>
            </div>
            <div class="advantage-item">
                <p>Изображения<br> — <br>Без ограничений по скорости и колличеству, конвертировать и ужать к публикации под необходимый формат и вес</p>
            </div>
            <div class="advantage-item">
                <p>Выполнить десятки других задач<br> — <br>Без переключения между окнами в браузере и ограничений в виде бесплатных ежедневных токенов.</p>
            </div>
        </div>
        <p> Meowka
            работает как швейцарский нож для редакторов контента — она избавляет от рутины и позволяет
            сосредоточиться на творческой части работы. Потому что ваше время слишком ценно, чтобы тратить его на то,
            что может сделать машина.
        </p>
        <h2>История создания</h2>
        <p class="text_indent">Программа была разработана энтузиастом, столкнувшимся с необходимостью выполнять
            однотипные операции сотни и
            сотни
            раз в день. Вместо того чтобы тратить часы на ручной труд, он решил создать инструмент, который сделает это
            за него. Так появилась "Meowka" — надежный цифровой кот-помошник, который берет на себя всю "грязную"
            работу, облегчая вам жизнь.
        </p>
        <h2>Почему Meowka?</h2>
        <p>Запустите MeowLinker — и позвольте себе сосредоточиться на самом важном, а не на мелочах, которые утомляют.</p>
        <ul class="ul_indent">
            <li>
                <p> — <b>Meowka</b> не требует постоянного подключения к интернету и полностью защищает ваши данные, обрабатывая
                    их локально. Это делает её идеальным выбором для тех, кто ценит конфиденциальность и стабильность.
                </p>
            </li>
            <li>
                <p> — <b>Meowka</b> позволяет внутри одной среды не только подготовить контент, но и выложить его автоматически.</p>
            </li>
            <li>
                <p> — <b>Meowka</b> исключает человеческий фактор — машина всегда заменит то что нужно заменить, удалит все что нужно
                    удалить и вставит контент туда, где он должен быть выложен. Ничего не упустит и ничего не забудет.
                </p>
            </li>
        </ul>
        <p style="text-align: center;">Просто начните работать — Meowka позаботится обо всём остальном!</p>
    </section>
</template>

<style scoped>
.advantage-item svg .a {
  fill: none;
  stroke-miterlimit: 10;
}
</style>